const howToPlay = {
  'zh-cn': {
    details: `
    欢乐时时彩投注区分为万位、千位、百位、十位和个位，各位号码范围为0～9。每期从各位上开出1个号码作为中奖号码，即开奖号码为5位数。欢乐时时彩玩法即是竞猜5位开奖号码的全部号码、部分号码或部分号码特征。欢乐时时彩分星彩玩法和大小单双玩法。星彩玩法包括一星、二星、三星、五星四种玩法。

<1>直选：将投注号码以惟一的排列方式进行投注。
<2>组选：将投注号码的所有排列方式作为一注投注号码进行投注。示例：123，排列方式有123、132、213、231、312、321，共计6种。
<3>组选三：在三星组选中，如果一注组选号码的3个数字有两个数字相同，则有3种不同的排列方式，因而就有3个中奖机会，这种组选投注方式简称组选三。示例：112，排列方式有112、121、211。
<4>组选六：在三星组选中，如果一注组选号码的3个数字各不相同，则有6种不同的排列方式，因而就有6个中奖机会，这种组选投注方式简称组选六。示例：123，排列方式有123、132、213、231、312、321，共计6种。
<5>大小单双：号码0～9中，0～4为小，5～9为大，1、3、5、7、9为单，0、2、4、6、8为双。

1、投注方式
    
    1、大小单双
    对十位和个位的大小单双4种特征中各选一种特征为一注，最多可4种特征全选，所选特征与开奖号码后两位号码特征一致即中奖，单注奖金4金币。示例：开奖号码后两位为78，则大大、大双、单双、单大为中奖。

    2、一星
    对个位选1个号码为一注，最多可0～9全选，投注号码与开奖号码后一位一致即为中奖，单注奖金10金币。

    3、二星直选
    对十位和个位各选1个号码为一注，每位号码最多可0～9全选，投注号码与开奖号码后两位按位一致即为中奖，单注奖金100金币。

    4、二星和值
    和值指号码各位数相加之和，如号码01，和值为1。二星和值投注指用某一二星和值对应的所有号码进行投注，所选和值与开奖号码后两位和值一致即为中奖，单注奖金100金币。示例：选择二星和值1投注，即用和值1所对应的号码（01、10）投注，如开奖号码后两位和值为1即中奖。

    5、二星组选
    从号码0—9中任选两个数字对十位和个位进行投注，最多可0～9全选。所选号码与开奖号码后两位一致，顺序不限，即为中奖，单注奖金50金币。示例：选择12，共1注，如开奖号码后两位为12或21即中奖。

    6、三星直选
    对百位、十位和个位各选1个号码为一注，每位号码最多可0～9全选，投注号码与开奖号码后三位按位一致即为中奖，单注奖金1000金币。

    7、三星和值
    和值指号码各位数相加之和，如号码001，和值为1。三星和值投注指用某一三星和值对应的所有号码进行投注，所选和值与开奖号码后三位和值一致即为中奖，单注奖金1000金币。示例：选择三星和值1投注，即用和值1所对应的号码（001、010、100）投注，如开奖号码后三位和值为1即中奖。

    8、组三包号
    组三包号指用所选号码的所有组三排列方式进行组选三投注，如开奖号码为组三号且包含在所选号码中即为中奖，单注奖金320金币。示例：组三包号12，共2注（112、122），如开奖号码后三位为112、121、211、122、212、221皆为中奖。
    说明：投注注数=A(n,2) 

    9、组六包号
    组六包号指用所选号码的所有组六排列方式进行组选六投注，如开奖号码为组六号且包含在所选号码中即为中奖，单注奖金160金币。示例：组六包号123，共1注，如开奖号码后三位为123、132、213、231、312、321皆为中奖。
    说明：投注注数= c（n，3）= A(n,3）/ A(3,3)

    10、五星直选
    对万位、千位、百位、十位和个位各选1个号码为一注，每位号码可从0～9全选，投注号码与开奖号码按位一致，即为中奖，单注奖金100000金币。
    
    11、五星通选
    对万位、千位、百位、十位和个位各选1个号码为一注，每位号码最多可0～9全选，投注号码与开奖号码按位一致即中一等奖，单注奖金20000金币。投注号码前三位与开奖号码前三位按位一致或投注号码后三位与开奖号码后三位按位一致即中二等奖，单注奖金200金币。投注号码前两位与开奖号码前两位按位一致或投注号码后两位与开奖号码后两位按位一致即中三等奖，单注奖金20金币。 五星通选一注号码，可三个奖级通吃，共有5次中奖机会，兼中兼得。即中了一等奖，同时也就中了2个二等奖和2个三等奖。同理，中了1注二等奖，同时也中了1注三等奖。
    
2、设奖与中奖

大小单双——中十位和个位大小单双——4金币
一星——中个位号码——10金币
二星直选奖——定位中后两码——100金币
二星组选奖——不定位中后两码——50金币
三星直选奖——定位中后三码——1000金币
三星组选三奖——不定位中后三码——320金币
三星组选六奖——不定位中后三码——160金币
五星直选奖——定位中5码——100000金币
五星通选一等奖——定位中5码——20000金币
五星通选二等奖——定位中前三码或后三码——200金币
五星通选三等奖——定位中前两码或后两码——20金币

注
    <1>假设当期的开奖号码为45678（组选三适用开奖号码为45668）。
    <2>前三码和后三码：前三码指开奖号码的前三位号码，后三码指开奖号码的后三位号码。示例：开奖号码为45678，前三码为456，后三码为678。
    <3>前两码和后两码：前两码指开奖号码的前两位号码，后两码指开号码的后两位号码。示例：开奖号码为45678，前两码为45，后两码为78。
    <4>定位和不定位：定位指投注号码与开奖号码按位一致，不定位指投注号码与开奖号码一致，顺序不限。示例：开奖号码为45678，78则定位中后两码，78或87则为不定位中后两码。`,
  },
};

export default howToPlay;
